{
  "0005655098": {
    "re": "The right eye has a history of pigmentary glaucoma and pseudophakia with a posterior chamber intraocular lens (PCIOL) following cataract surgery and laser peripheral iridotomy (LPI). Vision has remained stable at 6/6 with correction since the initial visit. Intraocular pressure (IOP) has decreased from 19 mmHg to a current level of 13 mmHg, with ongoing use of LACOMA-PF eye drops at night. The anterior segment shows a patent laser peripheral iridotomy and surgical peripheral iridectomy, normal anterior chamber depth, and a PCIOL. The optic disc demonstrates a cup-to-disc ratio (CDR) of 0.7 with a small disc and inferior rim thinning. The macula is clear, and the vasculature is normal. Currently, the eye is stable under medical management with no reported complications.",
    "le": "The left eye has a history of pigmentary glaucoma and pseudophakia with a PCIOL and YAG capsulotomy following trabeculectomy and laser peripheral iridotomy. Vision has been stable at 6/6 with correction since the initial visit. IOP has decreased from 14 mmHg to a current level of 12 mmHg, with no additional medications documented for this eye. The anterior segment shows a patent surgical peripheral iridectomy, a flat nasal bleb, and a diffuse superotemporal bleb, with a PCIOL and YAG opening. The optic disc demonstrates a CDR of 0.8 with superior rim thinning and inferior rim thinning. The macula is clear, and the vasculature is normal. The eye remains stable post-trabeculectomy with no reported complications.",
    "status": "Success",
    "mr_no": "P303202",
    "visit_count": 10,
    "first_visit": "2023-02-23",
    "last_visit": "2025-06-12"
  },
  "0009687282": {
    "re": "The right eye has a history of primary open-angle glaucoma (POAG) and underwent phacoemulsification with PCIOL implantation. Vision improved from 6/18 initially to 6/6P currently. The IOP has fluctuated but is currently 19 mmHg. The optic disc shows a cup-to-disc ratio of 0.65 with inferior notching, consistent across visits. Treatment has included prostaglandin analogs (Auroprost-RT) for IOP control, which appears to have stabilized the condition. The anterior segment is normal, with a clear PCIOL and no active inflammation. The fundus remains stable with clear media, normal vessels, and no evidence of macular edema or other complications.",
    "le": "The left eye has a history of POAG, pseudophakia following phacoemulsification with PCIOL implantation, and recent episcleritis noted nasally. Vision has remained stable, improving from 6/18 to 6/9 currently. The IOP has varied but is currently 19 mmHg. The optic disc shows a cup-to-disc ratio of 0.6 with inferior notching, consistent with glaucoma. Treatment includes prostaglandin analogs (Auroprost-RT) for IOP control and Flur eye drops for episcleritis. The anterior segment is normal except for nasal episcleritis, and the PCIOL is clear. The fundus is stable with clear media, normal vessels, and no macular edema or other complications.",
    "status": "Success",
    "mr_no": "P223443",
    "visit_count": 12,
    "first_visit": "2022-05-09",
    "last_visit": "2023-11-15"
  },
  "0010904095": {
    "re": "The right eye has a history of nuclear sclerosis, which progressed from grade II to grade III, and was most recently noted as associated with immature cataract and ocular hypertension. Visual acuity improved from 6/12 uncorrected to 6/6 with spectacles at the latest visit. IOP initially measured 19 mmHg, peaked at 38 mmHg, and is currently well-controlled at 14 mmHg following laser peripheral iridotomy (LPI) and anti-glaucoma medication. The anterior segment shows a clear posterior chamber intraocular lens (PCIOL) with a patent laser peripheral iridotomy and normal anterior chamber depth. The fundus examination reveals a clear media, normal optic disc with a cup-to-disc ratio of 0.4, and no evidence of macular edema or vascular abnormalities. The right eye is pseudophakic with stable vision and controlled IOP.",
    "le": "The left eye underwent micro-incision cataract surgery (MICS) with toric PCIOL implantation for nuclear sclerosis and high astigmatism. Visual acuity improved from 6/36 uncorrected to 6/6 with spectacles at the latest visit. IOP has remained stable, ranging from 13 to 19 mmHg, and is currently 15 mmHg. The anterior segment shows a clear PCIOL with normal anterior chamber depth and iris pattern. Fundus examination reveals a clear media, normal optic disc, and no macular or vascular abnormalities. The left eye is pseudophakic with excellent visual recovery and stable IOP.",
    "status": "Success",
    "mr_no": "P4448991",
    "visit_count": 16,
    "first_visit": "2023-05-02",
    "last_visit": "2025-04-18"
  },
  "0013650399": {
    "re": "The right eye has a history of pseudophakia and is currently classified as a glaucoma suspect. Visual acuity has remained stable from 6/6 with glasses at the initial visit to 6/6 with glasses at the most recent visit, with uncorrected visual acuity of 6/9. Intraocular pressure has been stable, recorded at 14 mmHg during the latest visit. The anterior segment findings, including a posterior chamber intraocular lens, are unremarkable with normal depth and clear media. Fundus examination reveals a cup-to-disc ratio of 0.7 with a deep cup, consistent with glaucoma suspicion, but no evidence of retinal or vascular abnormalities. The patient is currently using Refresh Tears eye drops bilaterally, and follow-up is advised in one year.",
    "le": "The left eye also has a history of pseudophakia and is a glaucoma suspect. Visual acuity has been stable, recorded as 6/6 with glasses at the most recent visit, with uncorrected visual acuity of 6/6P. Intraocular pressure has remained stable at 14 mmHg during the latest visit. Anterior segment findings, including a posterior chamber intraocular lens, are normal with clear media and pharmacologically dilated pupils. Fundus examination shows a cup-to-disc ratio of 0.65-0.7 with a deep cup and possible superior rim thinning, but no other abnormalities in the retina or vasculature. The patient is currently using Refresh Tears eye drops bilaterally, and follow-up is recommended in one year.",
    "status": "Success",
    "mr_no": "P1953682",
    "visit_count": 7,
    "first_visit": "2022-03-02",
    "last_visit": "2025-04-29"
  },
  "0014857333": {
    "re": "The right eye has a history of primary angle closure (PAC) and underwent laser peripheral iridotomy (LPI), which remains patent. Vision has been stable, recorded as 6/6 with correction in earlier visits and 6/9 uncorrected in the latest visit. Intraocular pressure (IOP) initially measured at 20 mmHg, peaked at 27 mmHg due to corticosteroid-induced ocular hypertension, and has since improved to 18 mmHg at the latest visit with the use of latanoprost eye drops. The anterior segment currently shows a clear lens and normal anterior chamber depth. The optic disc has a stable cup-to-disc ratio (CDR) of 0.5 without focal rim loss or neuroretinal rim thinning. The macula is clear, and no significant complications are noted.",
    "le": "The left eye also has a history of PAC and an immature cataract, with a patent LPI. Vision has been stable, recorded as 6/6 with correction in earlier visits and 6/9 uncorrected in the latest visit. IOP was initially 24 mmHg, peaked at 30 mmHg due to corticosteroid-induced ocular hypertension, and has since decreased to 17 mmHg with latanoprost treatment. The anterior segment shows a clear lens and normal anterior chamber depth. The optic disc has a stable CDR of 0.5 without focal rim loss or neuroretinal rim thinning, though the macula is noted to be hazy due to cataract. No other complications are documented.",
    "status": "Success",
    "mr_no": "P141728",
    "visit_count": 6,
    "first_visit": "2022-08-20",
    "last_visit": "2024-05-11"
  },
  "0015256042": {
    "re": "The right eye has a history of proliferative diabetic retinopathy (PDR) with prior panretinal photocoagulation (PRP) and secondary glaucoma, likely steroid-responsive. Vision has fluctuated, initially recorded as 6/24, improving to 6/12, and currently noted as 6/12. Intraocular pressure (IOP) has ranged from 18 to 23 mmHg, with the latest measurement at 22 mmHg. The anterior segment shows a pseudophakic intraocular lens (PCIOL) with a pharmacologically dilated pupil and normal anterior chamber depth. The fundus reveals fibrovascular proliferation (FVP) at the disc, PRP scars, and persistent traction without retinal detachment. The macula shows dullness, nasal drag, and schitic changes. The patient remains on Dorsun-T eye drops bilaterally for IOP control.",
    "le": "The left eye is affected by asteroid hyalosis, chronic tractional diabetic macular edema (DME), and tractional retinal detachment (TRD) secondary to PDR, with prior PRP and a pseudophakic intraocular lens (PCIOL). Vision has been poor throughout, with no measurable acuity recorded in recent visits. IOP has ranged from 14 to 25 mmHg, with the latest measurement at 18 mmHg. The anterior segment shows a PCIOL with a pharmacologically dilated pupil and normal anterior chamber depth. The fundus is notable for asteroid hyalosis, PRP scars, TRD, and schitic retinal changes. The macula demonstrates dullness and nasal drag. The patient is on Dorsun-T eye drops bilaterally for IOP management.",
    "status": "Success",
    "mr_no": "P5117837",
    "visit_count": 6,
    "first_visit": "2022-02-09",
    "last_visit": "2024-05-09"
  },
  "0016565877": {
    "re": "The right eye has a history of pseudophakia with a posterior chamber intraocular lens (PCIOL) and progressive glaucoma, with the most recent visit showing a cup-to-disc ratio of 0.85 and superior rim thinning with bipolar thinning. Visual acuity has declined from 6/9P with correction in earlier visits to 6/9 with spectacles and 5/60 uncorrected in the latest visit. Intraocular pressure (IOP) has fluctuated over time, with a current reading of 20 mmHg. The anterior chamber remains of normal depth, with an irregular pupil and PCIOL in place. The fundus shows a cup-to-disc ratio of 0.85 with superior notch and bipolar thinning, clear media, and normal vasculature. The current status indicates advanced glaucomatous changes with significant optic nerve damage and reduced vision.",
    "le": "The left eye is pseudophakic with a PCIOL and has a diagnosis of glaucoma. Visual acuity has remained relatively stable, with the latest visit showing 6/6 with spectacles and 6/9 uncorrected. IOP has varied but is currently 18 mmHg. The anterior segment is normal, with a clear PCIOL and a normal pupil. Fundus examination reveals a cup-to-disc ratio of 0.75 with superior rim thinning and retinal nerve fiber layer defects, clear media, and peripheral retinal pigment epithelium degeneration. The current status reflects stable vision but ongoing glaucomatous changes requiring monitoring.",
    "status": "Success",
    "mr_no": "P340820",
    "visit_count": 17,
    "first_visit": "2022-03-21",
    "last_visit": "2025-06-13"
  },
  "0016712107": {
    "re": "The right eye has a history of immature cataract and glaucoma suspect, with a cup-to-disc ratio of 0.6 noted on the most recent visit. Vision has remained stable, with uncorrected visual acuity at 6/18 and best-corrected visual acuity at 6/18. Intraocular pressure was 14 mmHg at the latest visit, showing stability compared to prior measurements. The anterior segment examination revealed a clear lens with normal anterior chamber depth, normal iris color and pattern, and normal conjunctiva. The fundus showed a cup-to-disc ratio of 0.6 with no additional abnormalities noted. The eye is currently being managed with lubricating eye drops.",
    "le": "The left eye has a history of pseudoexfoliation syndrome, pseudophakia, and glaucoma suspect, with a cup-to-disc ratio of 0.6 noted on the most recent visit. Vision has remained stable, with uncorrected visual acuity at 6/6P and best-corrected visual acuity at 6/6P. Intraocular pressure was 14 mmHg at the latest visit, consistent with prior measurements. The anterior segment examination revealed a clear posterior chamber intraocular lens, normal anterior chamber depth, normal iris color and pattern, and normal conjunctiva. The fundus showed a cup-to-disc ratio of 0.6 with no other significant findings. The eye is currently being managed with lubricating eye drops.",
    "status": "Success",
    "mr_no": "P1691674",
    "visit_count": 9,
    "first_visit": "2022-02-24",
    "last_visit": "2023-10-09"
  },
  "0017684556": {
    "re": "The right eye has a diagnosis of normal tension glaucoma (NTG) with a history of compound hyperopic astigmatism and presbyopia. Vision improved from 6/60 uncorrected initially to 6/6 with correction at the latest visit. IOP has fluctuated over time, ranging from 14 mmHg initially to a current value of 14 mmHg. The optic disc shows progressive changes, with the cup-to-disc ratio increasing from 0.7 to 0.8, along with inferior rim thinning. The anterior segment remains normal, and the lens is clear. The patient is on Xalatan eye drops nightly, which appears to have stabilized IOP.",
    "le": "The left eye shares the diagnosis of NTG, with a similar history of compound hyperopic astigmatism and presbyopia. Vision improved from 6/60 uncorrected initially to 6/9 with correction at the latest visit. IOP has ranged from 15 mmHg initially to a current value of 15 mmHg. Optic disc findings include a cup-to-disc ratio of 0.75 initially, progressing to 0.8 with inferior rim thinning. The anterior segment is normal, and the lens is clear. The patient is also on Xalatan eye drops nightly, which has contributed to stable IOP control.",
    "status": "Success",
    "mr_no": "P975577",
    "visit_count": 7,
    "first_visit": "2022-01-22",
    "last_visit": "2024-06-20"
  },
  "0018069526": {
    "re": "The right eye has been diagnosed as a glaucoma suspect with a history of posterior subcapsular cataract (PSC). Vision initially measured at 6/18 uncorrected, improving to 6/6 with glasses, and is currently recorded as 6/6. Intraocular pressure (IOP) has fluctuated, peaking at 24 mmHg but is now controlled at 20 mmHg with Timolol 0.5% eye drops. The optic disc shows a stable cup-to-disc ratio of 0.6 with a large disc and no retinal nerve fiber layer defects (RNFLD). The anterior segment remains unremarkable with minimal posterior subcapsular changes. Currently, the eye is stable under medical management with no documented complications.",
    "le": "The left eye is also a glaucoma suspect with a history of PSC. Vision was initially 6/18 uncorrected, improving to 6/9 with glasses, and remains stable at 6/9. IOP has shown variability, reaching a high of 23 mmHg but is now reduced to 16 mmHg with Timolol 0.5% eye drops. The optic disc demonstrates a cup-to-disc ratio of 0.7 with a large disc, inferior rim thinning, and no RNFLD. The anterior segment is clear with minimal posterior subcapsular changes. The eye is stable with ongoing treatment, and no complications have been reported.",
    "status": "Success",
    "mr_no": "P163594",
    "visit_count": 8,
    "first_visit": "2022-03-09",
    "last_visit": "2024-12-21"
  },
  "0018672756": {
    "re": "The right eye has a history of pigmentary glaucoma and post-trabeculectomy status. Vision has fluctuated from 6/18 with glasses initially to 6/18P with glasses at the latest visit. The intraocular pressure (IOP) has improved significantly, decreasing from 20 mmHg initially to 9 mmHg at the most recent visit. The anterior chamber is deep with a patent surgical peripheral iridectomy, a diffuse bleb, and central posterior subcapsular cataract (PSCC) with pigments on the anterior lens capsule. The optic disc shows a cup-to-disc ratio (CDR) of 0.9 with pallor, consistent with glaucomatous optic atrophy. The current status indicates stable IOP and clear media, with a small PED noted adjacent to the fovea.",
    "le": "The left eye has a history of pigmentary glaucoma and early lens opacity. Vision data is limited, with no recorded improvement or decline. The IOP has fluctuated, with a recent increase to 20 mmHg from 11 mmHg in prior visits. The anterior chamber is normal in depth, with lens changes including pigments on the anterior lens capsule and Scheie stripe. The optic disc shows glaucomatous optic atrophy with a CDR of 0.95. The current status indicates elevated IOP and stable fundus findings, with no new complications noted.",
    "status": "Success",
    "mr_no": "P2322079",
    "visit_count": 10,
    "first_visit": "2022-07-08",
    "last_visit": "2023-11-09"
  },
  "0018778471": {
    "re": "The right eye has a history of primary angle-closure glaucoma (PACG) with status post-laser peripheral iridotomy (LPI) and proliferative diabetic retinopathy (PDR) treated with panretinal photocoagulation (PRP). Vision has improved from 6/60 initially to 6/18 currently, with a best-corrected vision of 6/9 in prior visits. The intraocular pressure (IOP) has fluctuated, with the latest measurement at 27 mmHg, indicating elevated pressure. The anterior chamber is of normal depth with a clear pseudophakic intraocular lens (PCIOL) in place. Fundus findings include a cup-to-disc ratio (CDR) of 0.65 with superior neuroretinal rim thinning, PRP scars, and a few residual hemorrhages. The macula shows epiretinal membrane (ERM) and focal vitreomacular proliferation (FVP). The eye remains under close monitoring for glaucoma and diabetic retinopathy progression.",
    "le": "The left eye has a similar history of PACG with status post-LPI and PDR treated with PRP. Vision has remained stable at 6/12P currently, with prior best-corrected vision of 6/9. The IOP has been variable, with the latest reading at 26 mmHg, also elevated. The anterior segment shows a clear pseudophakic intraocular lens (PCIOL) with a normal anterior chamber depth. Fundus examination reveals a CDR of 0.6, PRP scars, a few residual hemorrhages, and macular findings of retinal pigment epithelium (RPE) alterations and FVP. The eye is being monitored for glaucoma and diabetic retinopathy stability.",
    "status": "Success",
    "mr_no": "P195824",
    "visit_count": 17,
    "first_visit": "2022-07-28",
    "last_visit": "2024-11-20"
  },
  "0019104480": {
    "re": "The right eye has a diagnosis of primary open-angle glaucoma (POAG) and presbyopia. Vision initially measured at 6/12 with glasses and improved to 6/6 with correction, and currently remains at 6/6 with spectacles. IOP has decreased from 26 mmHg at presentation to 19 mmHg at the latest visit, reflecting improved control with ongoing treatment. The optic disc shows a stable cup-to-disc ratio of 0.8 with no new documented structural changes. The anterior segment remains normal, with lens changes noted in recent visits, including nuclear sclerosis grade 1. Current management includes Timolol 0.5% drops twice daily, which appears effective in maintaining IOP control.",
    "le": "The left eye is also diagnosed with POAG and presbyopia. Vision initially measured at 6/24 uncorrected and improved to 6/6 with pinhole correction, currently stable at 6/6 with spectacles. IOP has reduced from 18 mmHg to 15 mmHg at the latest visit, indicating good response to treatment. The optic disc shows a cup-to-disc ratio of 0.8 with a superior notch and associated superior retinal nerve fiber layer thinning, which has remained stable. The anterior segment is normal, with lens changes including nuclear sclerosis grade 1. Current treatment includes Timolol 0.5% drops twice daily and Careprost LS drops at night, effectively maintaining IOP control.",
    "status": "Success",
    "mr_no": "P2934082",
    "visit_count": 8,
    "first_visit": "2022-10-05",
    "last_visit": "2025-05-26"
  },
  "0019718733": {
    "re": "The right eye has remained clinically stable throughout the documented visits, with no significant ocular pathology noted. Visual acuity has consistently been 6/6, and intraocular pressure (IOP) has remained within normal limits, recorded at 20 mmHg during the most recent visit. The anterior segment and fundus findings have been unremarkable, with no evidence of complications or active pathology. No treatments or interventions have been documented for this eye, and it remains unaffected by the systemic conditions noted in the patient’s history. The current status of the right eye is normal, with no concerns requiring intervention.",
    "le": "The left eye has a history of open globe injury, traumatic cataract, and subsequent surgical interventions, including corneal tear repair, pars plana vitrectomy (PPV), silicone oil injection (SOI), and later silicone oil removal (SOR). Visual acuity has declined over time, from counting fingers post-injury to 4/60 at the most recent visit. The anterior segment currently shows aphakia with a pharmacologically mid-dilated pupil and a deep anterior chamber with a patent peripheral iridotomy. The fundus reveals a clear media, attached retina, and macula on, with no evidence of retinal detachment or choroidal effusion. IOP, previously elevated, is now controlled at 20 mmHg. The eye remains stable post-SOR, with no active inflammation or complications noted.",
    "status": "Success",
    "mr_no": "P86507",
    "visit_count": 20,
    "first_visit": "2023-02-13",
    "last_visit": "2023-11-16"
  },
  "0020264606": {
    "re": "The right eye has a history of primary open-angle glaucoma (POAG) and underwent phacoemulsification with posterior chamber intraocular lens (PCIOL) implantation. Vision improved from 6/18P initially to 6/9 with correction at the latest visit. The intraocular pressure (IOP) was stable, measured at 14 mmHg during the most recent visit. The optic disc shows a cup-to-disc ratio of 0.65 with an inferior subtle notch, and the macula remains clear. Current treatment includes TIMOBEST and EYEMIST eye drops, both prescribed for both eyes. The eye is pseudophakic with a clear posterior capsule and no signs of endophthalmitis or other complications.",
    "le": "The left eye has primary open-angle glaucoma (POAG) and nuclear sclerosis, with a history of cataract surgery and PCIOL implantation. Vision has fluctuated, with the latest uncorrected visual acuity at 6/9P and best-corrected visual acuity at 6/6. The IOP was 14 mmHg at the most recent visit. The optic disc shows a cup-to-disc ratio of 0.7 with bipolar thinning, and the macula remains clear. Current treatment includes TIMOBEST and EYEMIST eye drops for both eyes. The eye is pseudophakic with a clear posterior capsule, and no signs of endophthalmitis or other complications were noted.",
    "status": "Success",
    "mr_no": "P621501",
    "visit_count": 11,
    "first_visit": "2023-06-03",
    "last_visit": "2024-01-25"
  },
  "0020319841": {
    "re": "The right eye has a history of primary angle-closure (PAC) and high myopia, with a diagnosis of absolute glaucoma noted in the most recent visit. Vision has declined over time, from 6/6 with correction initially to 6/36 with spectacles and 3/60 uncorrected currently. IOP has fluctuated, ranging from 18 mmHg initially to a current value of 20 mmHg. The anterior segment shows a patent laser peripheral iridectomy (LPI) and an immature cataract (IMC). Fundus examination reveals a cup-to-disc ratio of 0.4 with pallor, peripapillary atrophy (PPA), and geographic atrophy. Despite treatment with DORZOX-T eye drops, the eye demonstrates progressive glaucomatous damage and significant visual decline.",
    "le": "The left eye has a history of primary angle-closure glaucoma (PACG), high myopia, and amblyopia, with absolute glaucoma documented in the latest visit. Vision has been severely impaired throughout, with no light perception (NLP) currently. IOP has remained elevated, peaking at 70 mmHg in the most recent visit despite ongoing treatment with DORZOX-T and RIPATEC eye drops. The anterior segment shows a patent LPI, mid-dilated pupil with no reaction to light, and an immature cataract. Fundus findings include a cup-to-disc ratio of 0.9 with glaucomatous optic atrophy (GOA), PPA, and chorioretinal degeneration. The eye exhibits advanced glaucomatous damage with no functional vision.",
    "status": "Success",
    "mr_no": "P3028797",
    "visit_count": 8,
    "first_visit": "2023-06-14",
    "last_visit": "2025-03-28"
  },
  "0021016408": {
    "re": "The right eye has a history of blunt trauma leading to traumatic glaucoma, iris neovascularization, traumatic iridodialysis, and subluxation of the lens, with subsequent surgical interventions including pars plana lensectomy (PPL), pars plana vitrectomy (PPV), and secondary scleral-fixated intraocular lens (SFIOL) implantation. Vision has progressively declined from 6/60 initially to hand movements (HM) in the most recent visit, with perception of light only in the temporal quadrant. IOP has been persistently elevated, currently at 35 mmHg despite multiple treatments, including diode laser cyclophotocoagulation and anti-glaucoma medications. Complications include corneal haze, inflammatory fibrinous strands in the vitreous, and optic disc cupping with a cup-to-disc ratio of 0.95 and pallor. The retina remains attached, but the eye is now classified as having absolute glaucoma with hypoglobus and poor visual prognosis.",
    "le": "The left eye remains unaffected by trauma and has maintained stable vision at 6/9 with pinhole correction. IOP has been consistently within normal limits, currently at 15 mmHg. The anterior segment and fundus are unremarkable, with a clear lens and no evidence of neovascularization or other complications. The optic disc shows a stable cup-to-disc ratio of 0.55 with no significant changes over time. No interventions or treatments have been required for this eye, and it remains healthy with no signs of disease progression.",
    "status": "Success",
    "mr_no": "F164650",
    "visit_count": 14,
    "first_visit": "2023-11-03",
    "last_visit": "2024-10-29"
  },
  "0021034319": {
    "re": "The right eye has a history of aphakia following cataract surgery for a mature cataract complicated by traumatic anterior subluxation of the lens and secondary glaucoma. Vision has progressively declined from hand movements initially to 2/60 currently. IOP was elevated at 64 mmHg preoperatively but has stabilized to 18 mmHg at the latest visit with ongoing use of topical medications, including Dorsun-T and Ripatec. Anterior segment findings include aphakia with vitreous in the pupillary margin temporally and a well-healed main tunnel suture. Fundus examination shows a CDR of 0.7 with temporal pallor and vitreous condensations, indicating possible optic nerve damage. The current status reflects stable IOP but poor visual prognosis due to optic nerve changes and aphakia.",
    "le": "The left eye has a mature cataract with associated secondary glaucoma and acute conjunctivitis. Vision has remained stable at 6/60 since the initial visit. IOP has been well-controlled, currently at 14 mmHg, with no significant fluctuations. Anterior segment findings include a pharmacologically dilated pupil, diffuse conjunctival congestion, and discharge, with the lens status noted as mature cataract. Fundus examination is limited due to the cataract, but no significant posterior segment abnormalities have been visualized. The current status indicates stable IOP and vision, with ongoing management for conjunctivitis and cataract-related visual impairment.",
    "status": "Success",
    "mr_no": "P89472",
    "visit_count": 11,
    "first_visit": "2023-11-08",
    "last_visit": "2024-04-02"
  },
  "0022577896": {
    "re": "The right eye has a history of Cogan-Reese syndrome, ICE syndrome, and secondary glaucoma. Visual acuity initially measured at 6/18 improved to 6/9 with pinhole correction in the most recent visit. Intraocular pressure (IOP) was elevated across visits, peaking at 48 mmHg, but has since decreased to 16 mmHg following AADI implantation and subsequent management, including the use of topical antiglaucoma medications such as Misopt. The anterior chamber remains well-formed with the AADI tube positioned at 11 o'clock, not touching the iris or endothelium. The optic disc shows a stable cup-to-disc ratio of 0.65, with clear media and no evidence of vitreous or retinal abnormalities. Currently, the eye is stable with controlled IOP and maintained visual acuity.",
    "le": "The left eye has a diagnosis of Cogan-Reese syndrome, ICE syndrome, and secondary glaucoma. Visual acuity has remained stable at 6/6 throughout all visits, including the most recent. IOP has been consistently within normal limits, recorded at 14 mmHg in the latest visit. The anterior segment findings are unremarkable, with a normal anterior chamber depth and clear lens. The optic disc shows a stable cup-to-disc ratio of 0.5, with clear media and no significant posterior segment abnormalities. The left eye remains stable with no evidence of disease progression or complications.",
    "status": "Success",
    "mr_no": "P5912523",
    "visit_count": 9,
    "first_visit": "2024-10-16",
    "last_visit": "2025-03-29"
  },
  "0023111959": {
    "re": "The right eye has a history of congenital iris coloboma, fundus coloboma, immature cataract, and pterygium. Vision has remained stable at 6/36 uncorrected across visits. The anterior segment shows an inferonasal iris coloboma, irregular pharmacologically dilated pupil, and nuclear sclerosis grade 3 cataract. Fundus examination reveals a retinal coloboma inferiorly with no optic disc abnormalities. Intraocular pressure decreased from 21 mmHg initially to 19 mmHg currently. The patient is on Auroflox eye drops for the right eye, and no complications or significant changes have been noted in the latest visit.",
    "le": "The left eye has a history of congenital iris coloboma, fundus coloboma, and immature cataract. Vision has remained stable at 6/18 uncorrected across visits. The anterior segment shows a normal iris with a pharmacologically dilated pupil and a clear lens. Fundus examination reveals a retinal coloboma inferiorly and an optic disc pit. Intraocular pressure decreased from 18 mmHg initially to 16 mmHg currently. No treatments or complications have been documented for the left eye, and the condition appears stable.",
    "status": "Success",
    "mr_no": "P711812",
    "visit_count": 2,
    "first_visit": "2025-02-24",
    "last_visit": "2025-05-15"
  },
  "0003332771": {
    "re": "The right eye has a history of pseudophakia, severe nonproliferative diabetic retinopathy (NPDR), diabetic macular edema (DME), and secondary glaucoma. Vision initially measured at 6/6 with correction but declined to 6/24 by the most recent visit. IOP was elevated at 30 mmHg in January 2025, consistent with a steroid response following intravitreal triamcinolone (IVTA), but the current IOP is not measurable. Treatments included IVTA for DME and ongoing use of Brimonidine eye drops. Fundus findings revealed persistent dot and blot hemorrhages, hard exudates, and resolving macular edema with subfoveal detachment, with the latest foveal thickness at 275 µm. The current status shows resolving macular edema but ongoing severe NPDR and DME.",
    "le": "The left eye also has a history of pseudophakia, severe NPDR, and DME, with no documented procedures performed. Vision has remained stable at 6/6 with correction since the initial visit. IOP was consistently within normal limits across visits, with the most recent measurement being not measurable. Fundus findings include dot and blot hemorrhages, hard exudates, and parafoveal DME, with the latest foveal thickness at 383 µm. The current status indicates resolving macular edema with subfoveal detachment and persistent severe NPDR and DME.",
    "status": "Success",
    "mr_no": "P3786009",
    "visit_count": 14,
    "first_visit": "2024-01-16",
    "last_visit": "2025-07-14"
  },
  "0011285844": {
    "re": "The right eye has a history of chronic choroidal neovascular membrane (CNVM) associated with age-related macular degeneration (AMD) and pseudophakia. Vision has shown mild improvement over time, from 6/12P initially to 6/9P with correction at the latest visit. Intraocular pressure (IOP) was not recorded during the most recent visit. The anterior segment remains stable with a posterior chamber intraocular lens (PCIOL) and normal anterior chamber depth, iris, and conjunctiva. Fundus examination reveals a predominantly scarred parafoveal CNVM with resolving subfoveal subretinal fluid (SRF) and chronic parafoveal intraretinal fluid (IRF). The patient has undergone multiple intravitreal injections, including biosimilar Ranibizumab, with evidence of resolving SRF and subretinal hemorrhage (SRH). The condition is currently stable with ongoing management.",
    "le": "The left eye also has a history of chronic CNVM associated with AMD and pseudophakia. Vision has remained stable at 6/60 throughout the follow-up period, with no significant improvement noted. IOP was not recorded during the most recent visit. The anterior segment is stable with a PCIOL and normal anterior chamber depth, iris, and conjunctiva. Fundus findings indicate a scarred CNVM with chronic cystoid macular edema (CME) and resolving SRF. The patient has received multiple intravitreal injections, including biosimilar Ranibizumab, with evidence of partial resolution of SRF and SRH. The condition remains stable with ongoing treatment.",
    "status": "Success",
    "mr_no": "P4513776",
    "visit_count": 44,
    "first_visit": "2022-01-03",
    "last_visit": "2025-07-18"
  },
  "0011400902": {
    "re": "The right eye is diagnosed as normal. Vision was 6/18 uncorrected initially, improving to 6/6 with correction. The anterior segment examination revealed a clear lens with normal anterior chamber depth, iris color, and pattern. Intraocular pressure was 18 mmHg at the most recent visit. Fundus examination showed a normal macula, normal vasculature, and a normal optic disc. No treatments or complications were documented, and the eye remains stable with no active pathology.",
    "le": "The left eye has a history of rhegmatogenous retinal detachment (RRD) and is status post pars plana vitrectomy (PPV) with silicone oil insertion (SOI). Vision was counting fingers at 1 meter uncorrected, with no improvement on correction. The anterior segment showed aphakia with a normal anterior chamber depth, iris, and conjunctiva. Intraocular pressure was elevated at 24 mmHg, and the patient is on timolol 0.5% drops twice daily for IOP control. Fundus examination revealed a myopic disc, clear media, and attached retina with silicone oil in situ. The eye is stable post-surgery, with no active complications noted.",
    "status": "Success",
    "mr_no": "P4535280",
    "visit_count": 1,
    "first_visit": "2023-04-24",
    "last_visit": "2023-04-24"
  },
  "0012275037": {
    "re": "The right eye has a history of post-PRK status with no significant complications documented. Visual acuity has consistently remained stable at 6/6 across all visits, including the most recent. Intraocular pressure was last recorded as 21 mmHg in August 2024, with no current IOP data available. Anterior segment findings have consistently been normal, with a clear lens and normal depth of the anterior chamber. Fundus examination has shown no abnormalities except for an inferior pigmented lattice noted in August 2024. Current status remains stable with no active pathology or new interventions required.",
    "le": "The left eye shares a similar history of post-PRK status, with stable visual acuity at 6/6 throughout all visits, including the most recent. Intraocular pressure was last recorded as 14 mmHg in August 2024, with no current IOP data available. Anterior segment findings have been unremarkable, except for mild temporal subconjunctival hemorrhage noted in September 2024, which does not appear to have caused any significant complications. Fundus findings have been normal, with no evidence of active pathology. The eye remains stable with no new treatments or interventions required.",
    "status": "Success",
    "mr_no": "P1352885",
    "visit_count": 7,
    "first_visit": "2022-02-17",
    "last_visit": "2024-09-23"
  },
  "0014944010": {
    "re": "The right eye has a diagnosis of severe nonproliferative diabetic retinopathy (NPDR) with progression to proliferative diabetic retinopathy (PDR) and associated vitreous hemorrhage (VH). Visual acuity has remained stable at 6/9 since the second visit. Intraocular pressure (IOP) has been stable, with a current measurement of 14 mmHg. No procedures have been performed on the right eye, and there is no evidence of diabetic macular edema (DME) on the latest OCT. The fundus shows severe NPDR with PDR changes post-panretinal photocoagulation (PRP), and no active complications are noted. The right eye is currently stable under observation.",
    "le": "The left eye has severe NPDR with progression to PDR and associated vitreous hemorrhage. Visual acuity has declined from 6/12 at presentation to 6/18 currently. IOP has fluctuated between 11-17 mmHg, with a current measurement of 14 mmHg. PRP has been performed, and the fundus shows PDR changes post-PRP with stabilization and no evidence of diabetic macular edema on the latest OCT. The vitreous hemorrhage is resolving, and the macula appears clear. The left eye remains under close monitoring with no new complications noted.",
    "status": "Success",
    "mr_no": "P146756",
    "visit_count": 8,
    "first_visit": "2022-11-12",
    "last_visit": "2025-04-25"
  },
  "0015544396": {
    "re": "The right eye has a history of rhegmatogenous retinal detachment (RRD) treated with vitrectomy and C3F8 gas tamponade, resulting in pseudophakia and secondary glaucoma. Vision declined from 6/6P initially to 6/12P currently. IOP was elevated to 33 mmHg postoperatively but is now controlled at 12 mmHg with topical antiglaucoma therapy (Lopres 0.5% drops). Fundus findings include stable laser scars and a cup-to-disc ratio of 0.8, with a clear macula. The eye remains pseudophakic with a normal anterior segment and pharmacologically dilated pupil. The current status is stable with controlled IOP and improved vision.",
    "le": "The left eye has no history of retinal detachment but shares a diagnosis of secondary glaucoma. Vision has remained stable, improving from 6/9P to 6/6P with correction. IOP has been stable, recorded at 16-17 mmHg in prior visits and currently at 12 mmHg. The anterior segment is normal, with a clear PCIOL and normal pupil reaction. Fundus examination shows a cup-to-disc ratio of 0.9 with pale neuroretinal rim and stable laser scars. The macula is dull, and epiretinal membrane (ERM) is noted. The eye is stable with no acute complications.",
    "status": "Success",
    "mr_no": "P2660346",
    "visit_count": 10,
    "first_visit": "2023-05-03",
    "last_visit": "2024-10-18"
  },
  "0016092240": {
    "re": "The right eye has a history of scleral buckle surgery (S/P SB Surgery × 1). Vision was 4/60 uncorrected initially and remains unchanged. Current intraocular pressure (IOP) is 10 mmHg. Anterior segment examination shows a normal anterior chamber depth, normal iris color and pattern, clear lens, and normal pupil size and reaction. Fundus examination reveals a 0.3 cup-to-disc ratio (CDR), clear media, and a buckle effect with a demarcation line noted. The macula appears dull with subretinal gliosis present. No active complications are documented, and the eye is stable post-surgery.",
    "le": "The left eye has no significant ocular history. Vision is 6/6 uncorrected and remains stable. Current IOP is 10 mmHg. Anterior segment findings are normal, with a normal anterior chamber depth, normal iris color and pattern, clear lens, and normal pupil size and reaction. Fundus examination shows a normal optic disc, clear media, and no abnormalities in the macula or vessels. The eye is stable with no evidence of pathology or complications.",
    "status": "Success",
    "mr_no": "P2700790",
    "visit_count": 1,
    "first_visit": "2022-01-24",
    "last_visit": "2022-01-24"
  },
  "0016669482": {
    "re": "The patient initially presented with acute conjunctivitis in the right eye, characterized by conjunctival congestion and discharge, which resolved following a 7-day course of Tobramycin drops and Tocin ointment. Vision was not documented, and intraocular pressure (IOP) was not measurable across visits. Anterior segment findings, including anterior chamber depth, iris, pupil, and lens, remained normal throughout follow-up. The fundus examination during the latest visit showed a clear media, normal optic disc, vessels, and retina, with macular reflex present. Currently, the right eye shows no active pathology, and the condition appears resolved.",
    "le": "(Limited data available.) No diagnosis, vision, or IOP data were recorded for the left eye across visits. Anterior segment findings, including anterior chamber depth, iris, pupil, and lens, were normal during the latest visit. Fundus examination revealed a clear media, normal optic disc, vessels, and retina, with macular reflex present. No active pathology or abnormalities were noted in the left eye during the most recent evaluation.",
    "status": "Success",
    "mr_no": "P2180687",
    "visit_count": 2,
    "first_visit": "2022-01-21",
    "last_visit": "2022-01-28"
  },
  "0017373092": {
    "re": "The right eye has a history of lattice degeneration with prior barrage laser treatment and early cataract changes. Visual acuity has remained stable, with best-corrected vision at 6/6 in the most recent visit, consistent with prior visits. Intraocular pressure has been stable, recorded at 19 mmHg during the latest visit. The anterior segment shows normal depth, normal iris color and pattern, and early lens changes. Fundus examination reveals stable barrage laser scars with the retina attached and no new complications. The current status is stable with no active interventions required.",
    "le": "The left eye has a history of S/P pars plana vitrectomy with silicone oil insertion and subsequent removal, as well as PCIOL placement. Visual acuity has improved from 6/24P initially to 6/12 currently with glasses. Intraocular pressure has been stable, recorded at 20 mmHg in the latest visit. The anterior segment shows a PCIOL with emulsified oil behind the lens, and posterior capsular opacification with trapped oil bubbles. Fundus findings include stable laser scars and an attached retina. The eye is currently on Nepaflam eye drops, and no new complications or interventions are noted.",
    "status": "Success",
    "mr_no": "P2791411",
    "visit_count": 5,
    "first_visit": "2022-09-01",
    "last_visit": "2023-06-16"
  },
  "0017659198": {
    "re": "The right eye has no documented diagnosis across visits. Vision remained stable at 6/6 throughout all visits, with no significant refractive changes. Anterior segment findings, including anterior chamber depth, iris, conjunctiva, and pupil, were consistently normal, with lens changes noted but unspecified. Fundus examination showed no abnormalities, and macular clarity was maintained. Intraocular pressure was recorded as 15 mmHg initially, fluctuating to 18 mmHg, and was not measurable during the most recent visit. No procedures or treatments were performed on the right eye, and no complications were noted.",
    "le": "The left eye was diagnosed with central retinal vein occlusion (CRVO) and associated macular edema. Vision was stable at 6/9 across visits, with no significant improvement or decline. Anterior segment findings were unremarkable, with normal anterior chamber depth, iris, conjunctiva, and pupil, and unspecified lens changes. Fundus findings included optic disc edema, tortuous and engorged vessels, retinal hemorrhages extending to the periphery, and gross macular edema with mild vitreous haze. The patient received one intravitreal Avastin injection, as noted in the most recent visit. Intraocular pressure was recorded as 19 mmHg initially, decreased to 14 mmHg, and was not measurable during the latest visit.",
    "status": "Success",
    "mr_no": "F57675",
    "visit_count": 4,
    "first_visit": "2022-01-22",
    "last_visit": "2022-02-03"
  },
  "0017826959": {
    "re": "The right eye has a history of moderate nonproliferative diabetic retinopathy (NPDR) and diabetic macular edema (DME), with progression of nuclear sclerosis and posterior subcapsular cataract (PSCC) over time. Vision has remained stable at 6/36 uncorrected, with no significant improvement with correction. Intraocular pressure (IOP) was recorded as 18 mmHg during the most recent visit. The anterior segment currently shows a clear lens post-cataract surgery, with no active inflammation. Fundus examination reveals a clear media, normal optic disc, and no significant vascular abnormalities, though moderate NPDR persists. The eye is currently being managed with Nepawel eye drops, and the condition appears stable.",
    "le": "The left eye has a history of moderate NPDR, DME, and epiretinal membrane (ERM), with progression of PSCC and nuclear sclerosis leading to pseudophakia following cataract surgery. Vision has improved from 6/24 uncorrected to 6/18 currently, with correction providing further improvement to 6/9P. The latest IOP is 18 mmHg. The anterior segment is clear with a well-positioned posterior chamber intraocular lens (PCIOL). Fundus findings include persistent moderate NPDR with dot and blot hemorrhages and ERM, but no significant macular edema or other complications. The eye is being treated with Nepawel eye drops, and the condition is stable.",
    "status": "Success",
    "mr_no": "P5406506",
    "visit_count": 11,
    "first_visit": "2022-01-13",
    "last_visit": "2024-03-09"
  },
  "0018576839": {
    "re": "The right eye has a history of pseudophakia with a posterior chamber intraocular lens (PCIOL) and no documented amblyopia. Vision initially measured at 6/18P uncorrected, improving to 6/12 with glasses, and has remained stable at 6/18 uncorrected in the latest visit. The anterior segment consistently shows a normal depth anterior chamber, normal iris, and pharmacologically dilated pupil, with no neovascularization noted. Fundus findings reveal a clear media, normal optic disc, and persistent loss of foveal thickness with IS/OS disruption and hyperpigmentation, consistent with intraretinal cystoid changes (IJT). The most recent foveal thickness was 60 microns. Current IOP was not measurable during the last visit. The eye is being treated with lubricating eye drops and ointment.",
    "le": "The left eye has a history of amblyopia and pseudophakia with a PCIOL. Vision has been poor throughout, with initial uncorrected visual acuity of 3/60, improving to 6/36P with glasses, and currently stable at 6/60 uncorrected. The anterior segment findings are similar to the right eye, with a normal depth anterior chamber, normal iris, and pharmacologically dilated pupil, with no neovascularization. Fundus examination shows a clear media, normal optic disc, and persistent intraretinal scarring and thinning, with loss of foveal thickness and IS/OS disruption, consistent with IJT. The most recent foveal thickness was 60 microns. Current IOP was not measurable during the last visit. The eye is being treated with lubricating eye drops and ointment.",
    "status": "Success",
    "mr_no": "P101348",
    "visit_count": 6,
    "first_visit": "2022-06-20",
    "last_visit": "2023-08-14"
  },
  "0018851656": {
    "re": "The right eye initially presented with a nuclear cataract (NS4) and intermediate macular changes (IMC), with uncorrected visual acuity (UCVA) of 6/12P. Following cataract surgery with PCIOL implantation, vision improved to 6/6 with glasses by the latest visit. IOP has remained well-controlled, decreasing from 14 mmHg initially to 10 mmHg currently. The anterior segment is stable with a clear cornea, normal anterior chamber depth, and a well-positioned PCIOL. Fundus findings include chronic age-related macular degeneration (ARMD) with drusen and RPE degeneration, but no evidence of subretinal fluid or significant progression. The eye is currently stable with no complications noted.",
    "le": "The left eye presented with a nuclear cataract (NS2-3) and ARMD, with UCVA of 5/60 initially. Post-cataract surgery with PCIOL implantation, vision improved to 6/24P with glasses at the latest visit. IOP has been stable, measured at 12 mmHg currently. The anterior segment shows a clear cornea, normal anterior chamber depth, and a well-positioned PCIOL. Fundus examination reveals ARMD with drusen, RPE degeneration, and a chronic scar, consistent with stable findings. There is no evidence of subretinal fluid or other complications. The eye remains stable under current management.",
    "status": "Success",
    "mr_no": "P2912860",
    "visit_count": 15,
    "first_visit": "2022-08-13",
    "last_visit": "2023-06-09"
  },
  "0019023751": {
    "re": "The right eye has a history of epiretinal membrane (ERM) and lamellar macular hole (LMH), with prior pars plana vitrectomy (PPV) and internal limiting membrane peeling performed for these conditions. Vision declined from 6/60 initially to hand movements (HM) post-surgery, but improved to 6/60 uncorrected and 6/12 with correction at the most recent visit. IOP was stable across earlier visits, ranging from 10 to 20 mmHg, but was not recorded during the latest visit. Fundus findings have consistently shown ERM with LMH, cystic changes, and macular edema, with recent imaging indicating persistent loss of foveal contour and a thin membrane on the retinal surface. The eye is currently under topical anti-inflammatory treatment, with Nepaflam-OD prescribed once daily.",
    "le": "The left eye has a history of nuclear sclerosis (NS) grade II and posterior subcapsular cataract (PSCC), with no surgical interventions documented. Vision has remained stable, improving from 6/12P uncorrected to 6/9 uncorrected and 6/6 corrected at the latest visit. IOP was recorded between 16 and 20 mmHg in earlier visits but was not measured during the most recent visit. Fundus findings have been unremarkable, with no significant abnormalities noted. The anterior segment shows NS and PSCC, with no acute changes or complications reported. The left eye remains stable without active treatment.",
    "status": "Success",
    "mr_no": "P2345291",
    "visit_count": 8,
    "first_visit": "2022-09-19",
    "last_visit": "2023-02-21"
  },
  "0019382550": {
    "re": "The right eye has a history of hyperopia and early cataract, with no significant posterior segment pathology. Vision initially measured at 6/36 uncorrected, improving to 6/9 with glasses, and is currently 6/24 uncorrected and 6/6 with correction. Intraocular pressure (IOP) has ranged from 15 to 21 mmHg, with the most recent reading at 12 mmHg. The anterior segment remains normal, with early lens changes noted. The optic disc shows a cup-to-disc ratio (CDR) of 0.4 with healthy neuroretinal rim and no significant abnormalities. The macula is clear, and no active treatment has been required for this eye. The current status is stable with no complications.",
    "le": "The left eye has a history of central serous chorioretinopathy (CSCR) and early cataract. Vision has fluctuated from 6/60 uncorrected to 6/12 with glasses, and is currently 6/36 uncorrected and 6/9 with correction. IOP has ranged from 15 to 20 mmHg, with the latest reading at 16 mmHg. The anterior segment is normal, with early lens changes noted. The optic disc shows a CDR of 0.4 with a dull neuroretinal rim. The macula shows persistent subretinal fluid (SRF) and pigment epithelial detachment (PED) despite prior micropulse laser treatment. The current status indicates stable CSCR with no new complications.",
    "status": "Success",
    "mr_no": "F122394",
    "visit_count": 11,
    "first_visit": "2022-11-30",
    "last_visit": "2023-08-21"
  },
  "0019551250": {
    "re": "The right eye has a history of chronic angle-closure glaucoma, aphakia, and post-trabeculectomy status with persistent complications, including neovascular/rubeotic glaucoma and absolute glaucoma. Vision has progressively declined from 6/60 initially to hand movements (HM) in the most recent visit. IOP has fluctuated significantly, with a peak of 55 mmHg initially, followed by a reduction to 3 mmHg currently, likely due to multiple interventions, including trabeculectomy, diode CPC, and medical management with multiple IOP-lowering agents. The anterior chamber is irregular with 360-degree PAS and a flat bleb, and the iris shows peripheral anterior synechiae (PAS) and neovascularization (NVI). The optic disc is pale with a CDR of 0.9 and significant rim thinning, and the fundus shows vitreous pigments, dull foveal reflex, and RPE changes. The current status indicates advanced glaucomatous damage with hypotony and a pre-phthisical appearance.",
    "le": "The left eye has a diagnosis of primary angle closure (PAC) and is status post-laser peripheral iridotomy (LPI). Vision has remained stable, improving from 6/9 initially to 6/12 currently with pinhole correction. IOP has been well-controlled, with the latest measurement at 17 mmHg. The anterior chamber is of normal depth with a patent LPI, and the lens shows nuclear sclerosis (NS2). The optic disc has a stable CDR of 0.3 with minimal temporal pallor, and the fundus examination reveals a clear media, normal vessels, and a visible foveal reflex. The left eye remains stable with no significant progression of disease.",
    "status": "Success",
    "mr_no": "P505744",
    "visit_count": 35,
    "first_visit": "2023-01-05",
    "last_visit": "2025-06-27"
  },
  "0020058637": {
    "re": "The right eye has a history of high myopia and underwent ICL implantation, later followed by ICL removal and phacoemulsification with PCIOL implantation. Vision improved from 6/60 initially to 6/6 with glasses at the latest visit. The anterior segment currently shows a PCIOL in situ with normal anterior chamber depth and a patent laser peripheral iridectomy. The fundus reveals a stable myopic disc with inferior pigmented lattice degeneration post-barrage laser, and no new lesions were noted. Current IOP was not recorded during the last visit, but prior measurements ranged from 13 to 21 mmHg. The eye remains pseudophakic with stable posterior segment findings.",
    "le": "The left eye has a history of high myopia with ICL implantation and lens changes. Vision declined from 6/12P initially to 6/60 with glasses at the latest visit. The anterior segment shows an ICL in situ with pharmacologically dilated pupils and lens changes. The fundus demonstrates a stable myopic disc with inferior and superior pigmented lattice degeneration post-barrage laser, with no new lesions. Current IOP was not recorded during the last visit, but prior measurements ranged from 12 to 18 mmHg. The eye remains stable with no acute complications noted.",
    "status": "Success",
    "mr_no": "P1911700",
    "visit_count": 11,
    "first_visit": "2023-04-24",
    "last_visit": "2023-10-13"
  },
  "0020163579": {
    "re": "The right eye has a diagnosis of immature cataract and polypoidal choroidal vasculopathy (PCV). Vision has remained stable, with uncorrected visual acuity (UCVA) of 6/12 initially, improving to 6/9 and currently 6/12, corrected to 6/6P. Intraocular pressure (IOP) has been stable, measured at 20 mmHg in the latest visit. The anterior segment shows a clear lens with normal anterior chamber depth, normal iris color and pattern, and normal pupil size and reaction to light. The fundus examination reveals a normal optic disc, vessels, and macula, with no significant abnormalities noted. The current status of the right eye is stable, with no complications or active treatments documented.",
    "le": "The left eye has a history of vitreous hemorrhage, PCV, and an immature cataract, with multiple surgical interventions including pars plana vitrectomy (PPV), fluid-air exchange, internal limiting membrane peeling, phacoemulsification with intraocular lens implantation, and silicone oil removal. Vision has declined from UCVA of 2/60 to 5/60, with no improvement on correction. Current IOP is 14 mmHg. The anterior segment shows dispersed hyphema, subconjunctival silicone oil, and a posterior capsular opacity. Fundus findings include a retina that is attached with barrage laser marks, but there are inferior retinal detachment (ReRD) and multiple breaks inferiorly and nasally. The left eye remains under close monitoring post-surgery, with no active complications requiring immediate intervention.",
    "status": "Success",
    "mr_no": "P5656799",
    "visit_count": 12,
    "first_visit": "2023-05-14",
    "last_visit": "2023-12-04"
  },
  "0020408193": {
    "re": "The right eye has a history of immature cataract (IMC) and is noted to be the patient's only functional eye. Visual acuity has declined from 6/24 with pinhole to 6/36 as of the latest visit. Intraocular pressure (IOP) was 14 mmHg at the most recent assessment. The anterior segment shows a clear lens with nuclear sclerosis (NS II) and no evidence of corneal abnormalities. Fundus examination reveals a cup-to-disc ratio of 0.7 with a thin neuroretinal rim, and a barraged retinal break near the superior temporal arcade. The eye remains under observation, with no recent interventions documented, and clearance for phacoemulsification surgery has been suggested.",
    "le": "The left eye has a history of therapeutic keratoplasty (TKP) for a corneal ulcer, now complicated by corneal graft failure and aphakia. Vision remains at hand movements (HM) since the procedure, with IOP currently not measurable. The anterior segment shows a centrally formed anterior chamber with minimal congestion and a blood-tinged aqueous humor. The corneal graft is edematous, and the lens is absent. Fundus details are not visualized due to anterior segment opacity. Glue-assisted bandage contact lens (BCL) was applied during the latest visit, and the eye is being monitored for potential corneal perforation.",
    "status": "Success",
    "mr_no": "F862428",
    "visit_count": 15,
    "first_visit": "2023-07-01",
    "last_visit": "2024-10-26"
  },
  "0020956509": {
    "re": "The right eye has a history of immature cataract, pseudophakia, moderate nonproliferative diabetic retinopathy (NPDR), and diabetic macular edema (DME). Vision has remained stable at 6/60 (UCVA) across visits, with no significant improvement noted. Intraocular pressure (IOP) was 17 mmHg at the most recent visit. The anterior segment shows a clear posterior chamber intraocular lens (PCIOL) with a normal anterior chamber depth and no neovascularization of the iris (NVI). Fundus examination reveals dot-blot hemorrhages, cotton wool spots, and drusen, with dull macular reflex and parafoveal hard exudates associated with cystic changes and irregular retinal pigment epithelium (RPE). The current status indicates stable NPDR with persistent macular edema and no acute complications.",
    "le": "The left eye has a history of pseudophakia, moderate NPDR, and DME. Vision has fluctuated, improving from 6/36 to 6/9 (UCVA) before stabilizing at 6/24 in the most recent visit. IOP was elevated at 20 mmHg during the last visit. The anterior segment shows a clear PCIOL, normal anterior chamber depth, and no NVI. Fundus findings include dot-blot hemorrhages, cotton wool spots, drusen, and lamellar macular hole (LMH) with parafoveal hard exudates, cystic changes, and irregular RPE. The current status reflects stable NPDR with persistent macular edema and no acute complications.",
    "status": "Success",
    "mr_no": "P5740970",
    "visit_count": 9,
    "first_visit": "2023-10-20",
    "last_visit": "2025-01-30"
  }
}